日程安排/2020/2021.org
#+TITLE:     2021
#+AUTHOR:    rzry https://github.com/rzry
#+EMAIL:     rzry36008@ccie.lol
#+DATE:      2021-01-10
#+LANGUAGE:  en

* 2021
** 2021.1.03 --> 2021.1.10
*** Company
**** 本周完成工作
  - 1 . hugePool 重复代码迁移
  - 2 . FileCoin 充提划转,地址密钥生成 (60%)
  - 3 . Message Detail数据校验, 测试数据完整性.
**** 下周工作计划
  - 1 . 完成 FileCoin 充提,地址密钥生成(不与用户绑定,周三会前)
      - 会做批量地址生成与留空用户绑定
  - 2 . 周三需求待定.
  - 3 . 协助测试,测试Message数据完整性
  - 4 . 查看新需求文档,找出重复代码需要修改的地方.(周三会前)

**** 问题.
  - 1 . ...
  - 2 . ...
*** Life
    - 图书馆阅读 Go并发之道 45页
    - 阅读 智能合约 dapp开发 solidity ..
    - 学习FileCoin 充提 提 request pull
    - 认识了一个新的好朋友
    - 看了缉魂(2遍) 张震是真的好看

** 2021.1.11 --> 2021.1.17
*** Company
**** 本周完成工作
     - 1 . filecoin ,转账,回笼 完成单元测试
     - 2 . 梳理现项目代码,以及下部分工作
     - 3 . 配合测试进行Message Detail 数据校验,测试数据完整性
**** 下周工作计划
     - 1 . 分拥模块,邀请,部分用户模块,和权限模块
     - 2 . 下部分周三待定
**** 问题
     - 1 . 若需,继续协助测试Mesasge Detail 部分数据
     - 2 . Message Detail 时间久因为不太好测.然后要确定准确性比较难
     - 3 . 下周问题,若存在再解决
*** Life
     - 1 . 看了温暖的抱抱
     - 2 . 请了一天假,为了写完部分需求到凌晨
     - 3 . 帮王同学排忧解难 , 这是我今年最蠢的一件事
     - 4 . 沙发睡了一晚上
     - 5 . 翻了一边 Linux就该这么学 有不一样的体会
*** WantDo
     - 1 . 喝醉一次
     - 2 . 下周把Go并发之道 的 demo debug一遍
     - 3 . innodb的一些基础(看50%)
     - 4 . 看看桌面那本linux shell
     - 5 . 有机会的话 再看一遍缉魂 只是想支持作者
     - 6 . 一定要做完自己答应别人的工作!

** 2021.1.17 --> 2021.1.24
*** Company
**** 本周完成工作
     - 1 . 分拥模块结束
     - 2 . 邀请结束
     - 3 . 部分用户模块接口结束
**** 下周工作计划
     - 1 . FILECOIN 分发收益(分红)
     - 2 . 部分定时任务
**** 问题
     - 1 . 无
*** Life
    - 1 . 看了大红包
    - 2 . 看了GO并发之道过了一遍, DEMO 到第二章

*** WantDo
    - 1 .

** 2021.1.25 --> 2021.1.31
*** Company
**** 本周完成工作
     - 1 . FILECOIN 分发收益,自测
     - 2 . 用户模块修改
**** 下周工作计划
     - 1 .
**** 问题
     - 1 . 为什么我的怨气那么重
*** Life
    - 1 . 买了300USDT的ETH*3(这就作为我投资的本金)
    - 2 . 看了一部分<投资最重要的事>(准备看完)
    - 3 . 还是买了回家的机票,但是内心充满了不回家的期望
    - 4 . Go并发之道的第二遍,每行代码都debug(准备看3遍)
    - 5 . 和女朋友讨论了相处方式,以后晚上我提前陪她打电话
    - 6 . 这个项目快结束了,但是我现在的怨气觉得很重
    - 7 . 在bilibili上发了一个新的关于我arch 的视频(自己并不满意)
*** WantDo
    - 1 . 首先把Go并发之道后几章的代码都debug了(赶在回家之前做完这件事)
    - 2 . 新找到了一本<网络是怎样连接的>.这周末有机会去图书馆借到这本书
    - 3 . 桌面那本Linux Shell 还是没有进行...
    - 4 . innodb也在等到完成
    - 5 . 我现在对于redis 的欠缺,可能是致命的.
    - 6 . 浏览器博客TODO(sync.Mutex)
** 2021.2.1 --> 2021.2.7
*** Company
**** 本周完成工作
     - 1 . 分佣,包括用户相关结束
     - 2 . 测试结束
**** 下周工作计划
     - 1 . 放假
     - 2 . 今年不回家,买球拍,去打球
     - 3 . 看完并发之道
     - 4 . 看完并发之道
**** 问题
     - 1 .
*** Life
    - 1 . 去爬山 .
    - 2 . 看完新出的电影
    - 3 . 给女朋友准备礼物
    - 4 . 给家里打电话
    - 5 . 给女朋友家里准备礼物
    - 6 . 拜年
*** WantDo
    - 1 . ...
