日程安排/2020/2021.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-08 一 15:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2021</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rzry https://github.com/rzry" />
<link rel='stylesheet' type='text/css' href='http://zxxky.cn/1.css'>
</head>
<body>
<div id="content">
<h1 class="title">2021</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcb99920">1. 2021</a>
<ul>
<li><a href="#orgcc1af7e">1.1. 2021.1.03 &#x2013;&gt; 2021.1.10</a>
<ul>
<li><a href="#org6e4de9f">1.1.1. Company</a></li>
<li><a href="#orgb9e0347">1.1.2. Life</a></li>
</ul>
</li>
<li><a href="#org3f2fa70">1.2. 2021.1.11 &#x2013;&gt; 2021.1.17</a>
<ul>
<li><a href="#orgded802f">1.2.1. Company</a></li>
<li><a href="#orgc59230a">1.2.2. Life</a></li>
<li><a href="#orgf42457f">1.2.3. WantDo</a></li>
</ul>
</li>
<li><a href="#org8e72a1c">1.3. 2021.1.17 &#x2013;&gt; 2021.1.24</a>
<ul>
<li><a href="#org1dcd663">1.3.1. Company</a></li>
<li><a href="#org893762a">1.3.2. Life</a></li>
<li><a href="#org9f6277b">1.3.3. WantDo</a></li>
</ul>
</li>
<li><a href="#org7d811f9">1.4. 2021.1.25 &#x2013;&gt; 2021.1.31</a>
<ul>
<li><a href="#orga0b00de">1.4.1. Company</a></li>
<li><a href="#org52c284c">1.4.2. Life</a></li>
<li><a href="#org074dc0d">1.4.3. WantDo</a></li>
</ul>
</li>
<li><a href="#orge11c81e">1.5. 2021.2.1 &#x2013;&gt; 2021.2.7</a>
<ul>
<li><a href="#org5c46c12">1.5.1. Company</a></li>
<li><a href="#org5b51681">1.5.2. Life</a></li>
<li><a href="#org479c448">1.5.3. WantDo</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgcb99920" class="outline-2">
<h2 id="orgcb99920"><span class="section-number-2">1</span> 2021</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcc1af7e" class="outline-3">
<h3 id="orgcc1af7e"><span class="section-number-3">1.1</span> 2021.1.03 &#x2013;&gt; 2021.1.10</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org6e4de9f" class="outline-4">
<h4 id="org6e4de9f"><span class="section-number-4">1.1.1</span> Company</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="orgd3b982e"></a>本周完成工作<br />
<div class="outline-text-5" id="text-1-1-1-1">
<ul class="org-ul">
<li>1 . hugePool 重复代码迁移</li>
<li>2 . FileCoin 充提划转,地址密钥生成 (60%)</li>
<li>3 . Message Detail数据校验, 测试数据完整性.</li>
</ul>
</div>
</li>
<li><a id="org6e723f6"></a>下周工作计划<br />
<div class="outline-text-5" id="text-1-1-1-2">
<ul class="org-ul">
<li>1 . 完成 FileCoin 充提,地址密钥生成(不与用户绑定,周三会前)
<ul class="org-ul">
<li>会做批量地址生成与留空用户绑定</li>
</ul></li>
<li>2 . 周三需求待定.</li>
<li>3 . 协助测试,测试Message数据完整性</li>
<li>4 . 查看新需求文档,找出重复代码需要修改的地方.(周三会前)</li>
</ul>
</div>
</li>

<li><a id="orgbbf8971"></a>问题.<br />
<div class="outline-text-5" id="text-1-1-1-3">
<ul class="org-ul">
<li>1 . &#x2026;</li>
<li>2 . &#x2026;</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgb9e0347" class="outline-4">
<h4 id="orgb9e0347"><span class="section-number-4">1.1.2</span> Life</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>图书馆阅读 Go并发之道 45页</li>
<li>阅读 智能合约 dapp开发 solidity ..</li>
<li>学习FileCoin 充提 提 request pull</li>
<li>认识了一个新的好朋友</li>
<li>看了缉魂(2遍) 张震是真的好看</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3f2fa70" class="outline-3">
<h3 id="org3f2fa70"><span class="section-number-3">1.2</span> 2021.1.11 &#x2013;&gt; 2021.1.17</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgded802f" class="outline-4">
<h4 id="orgded802f"><span class="section-number-4">1.2.1</span> Company</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="orgffdae9b"></a>本周完成工作<br />
<div class="outline-text-5" id="text-1-2-1-1">
<ul class="org-ul">
<li>1 . filecoin ,转账,回笼 完成单元测试</li>
<li>2 . 梳理现项目代码,以及下部分工作</li>
<li>3 . 配合测试进行Message Detail 数据校验,测试数据完整性</li>
</ul>
</div>
</li>
<li><a id="orgf4d98fc"></a>下周工作计划<br />
<div class="outline-text-5" id="text-1-2-1-2">
<ul class="org-ul">
<li>1 . 分拥模块,邀请,部分用户模块,和权限模块</li>
<li>2 . 下部分周三待定</li>
</ul>
</div>
</li>
<li><a id="orga78d097"></a>问题<br />
<div class="outline-text-5" id="text-1-2-1-3">
<ul class="org-ul">
<li>1 . 若需,继续协助测试Mesasge Detail 部分数据</li>
<li>2 . Message Detail 时间久因为不太好测.然后要确定准确性比较难</li>
<li>3 . 下周问题,若存在再解决</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgc59230a" class="outline-4">
<h4 id="orgc59230a"><span class="section-number-4">1.2.2</span> Life</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>1 . 看了温暖的抱抱</li>
<li>2 . 请了一天假,为了写完部分需求到凌晨</li>
<li>3 . 帮王同学排忧解难 , 这是我今年最蠢的一件事</li>
<li>4 . 沙发睡了一晚上</li>
<li>5 . 翻了一边 Linux就该这么学 有不一样的体会</li>
</ul>
</div>
</div>
<div id="outline-container-orgf42457f" class="outline-4">
<h4 id="orgf42457f"><span class="section-number-4">1.2.3</span> WantDo</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>1 . 喝醉一次</li>
<li>2 . 下周把Go并发之道 的 demo debug一遍</li>
<li>3 . innodb的一些基础(看50%)</li>
<li>4 . 看看桌面那本linux shell</li>
<li>5 . 有机会的话 再看一遍缉魂 只是想支持作者</li>
<li>6 . 一定要做完自己答应别人的工作!</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8e72a1c" class="outline-3">
<h3 id="org8e72a1c"><span class="section-number-3">1.3</span> 2021.1.17 &#x2013;&gt; 2021.1.24</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org1dcd663" class="outline-4">
<h4 id="org1dcd663"><span class="section-number-4">1.3.1</span> Company</h4>
<div class="outline-text-4" id="text-1-3-1">
</div>
<ol class="org-ol">
<li><a id="orge6ff265"></a>本周完成工作<br />
<div class="outline-text-5" id="text-1-3-1-1">
<ul class="org-ul">
<li>1 . 分拥模块结束</li>
<li>2 . 邀请结束</li>
<li>3 . 部分用户模块接口结束</li>
</ul>
</div>
</li>
<li><a id="orgc87c713"></a>下周工作计划<br />
<div class="outline-text-5" id="text-1-3-1-2">
<ul class="org-ul">
<li>1 . FILECOIN 分发收益(分红)</li>
<li>2 . 部分定时任务</li>
</ul>
</div>
</li>
<li><a id="org60907dd"></a>问题<br />
<div class="outline-text-5" id="text-1-3-1-3">
<ul class="org-ul">
<li>1 . 无</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org893762a" class="outline-4">
<h4 id="org893762a"><span class="section-number-4">1.3.2</span> Life</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>1 . 看了大红包</li>
<li>2 . 看了GO并发之道过了一遍, DEMO 到第二章</li>
</ul>
</div>
</div>

<div id="outline-container-org9f6277b" class="outline-4">
<h4 id="org9f6277b"><span class="section-number-4">1.3.3</span> WantDo</h4>
<div class="outline-text-4" id="text-1-3-3">
<ul class="org-ul">
<li>1 .</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7d811f9" class="outline-3">
<h3 id="org7d811f9"><span class="section-number-3">1.4</span> 2021.1.25 &#x2013;&gt; 2021.1.31</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orga0b00de" class="outline-4">
<h4 id="orga0b00de"><span class="section-number-4">1.4.1</span> Company</h4>
<div class="outline-text-4" id="text-1-4-1">
</div>
<ol class="org-ol">
<li><a id="org1c2b454"></a>本周完成工作<br />
<div class="outline-text-5" id="text-1-4-1-1">
<ul class="org-ul">
<li>1 . FILECOIN 分发收益,自测</li>
<li>2 . 用户模块修改</li>
</ul>
</div>
</li>
<li><a id="org3319d4b"></a>下周工作计划<br />
<div class="outline-text-5" id="text-1-4-1-2">
<ul class="org-ul">
<li>1 .</li>
</ul>
</div>
</li>
<li><a id="orgaaf1c7d"></a>问题<br />
<div class="outline-text-5" id="text-1-4-1-3">
<ul class="org-ul">
<li>1 . 为什么我的怨气那么重</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org52c284c" class="outline-4">
<h4 id="org52c284c"><span class="section-number-4">1.4.2</span> Life</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li>1 . 买了300USDT的ETH*3(这就作为我投资的本金)</li>
<li>2 . 看了一部分&lt;投资最重要的事&gt;(准备看完)</li>
<li>3 . 还是买了回家的机票,但是内心充满了不回家的期望</li>
<li>4 . Go并发之道的第二遍,每行代码都debug(准备看3遍)</li>
<li>5 . 和女朋友讨论了相处方式,以后晚上我提前陪她打电话</li>
<li>6 . 这个项目快结束了,但是我现在的怨气觉得很重</li>
<li>7 . 在bilibili上发了一个新的关于我arch 的视频(自己并不满意)</li>
</ul>
</div>
</div>
<div id="outline-container-org074dc0d" class="outline-4">
<h4 id="org074dc0d"><span class="section-number-4">1.4.3</span> WantDo</h4>
<div class="outline-text-4" id="text-1-4-3">
<ul class="org-ul">
<li>1 . 首先把Go并发之道后几章的代码都debug了(赶在回家之前做完这件事)</li>
<li>2 . 新找到了一本&lt;网络是怎样连接的&gt;.这周末有机会去图书馆借到这本书</li>
<li>3 . 桌面那本Linux Shell 还是没有进行&#x2026;</li>
<li>4 . innodb也在等到完成</li>
<li>5 . 我现在对于redis 的欠缺,可能是致命的.</li>
<li>6 . 浏览器博客TODO(sync.Mutex)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge11c81e" class="outline-3">
<h3 id="orge11c81e"><span class="section-number-3">1.5</span> 2021.2.1 &#x2013;&gt; 2021.2.7</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org5c46c12" class="outline-4">
<h4 id="org5c46c12"><span class="section-number-4">1.5.1</span> Company</h4>
<div class="outline-text-4" id="text-1-5-1">
</div>
<ol class="org-ol">
<li><a id="org28b2b1d"></a>本周完成工作<br />
<div class="outline-text-5" id="text-1-5-1-1">
<ul class="org-ul">
<li>1 . 分佣,包括用户相关结束</li>
<li>2 . 测试结束</li>
</ul>
</div>
</li>
<li><a id="org9a6149e"></a>下周工作计划<br />
<div class="outline-text-5" id="text-1-5-1-2">
<ul class="org-ul">
<li>1 . 放假</li>
<li>2 . 今年不回家,买球拍,去打球</li>
<li>3 . 看完并发之道</li>
<li>4 . 看完并发之道</li>
</ul>
</div>
</li>
<li><a id="org5a8f5f4"></a>问题<br />
<div class="outline-text-5" id="text-1-5-1-3">
<ul class="org-ul">
<li>1 .</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org5b51681" class="outline-4">
<h4 id="org5b51681"><span class="section-number-4">1.5.2</span> Life</h4>
<div class="outline-text-4" id="text-1-5-2">
<ul class="org-ul">
<li>1 . 去爬山 .</li>
<li>2 . 看完新出的电影</li>
<li>3 . 给女朋友准备礼物</li>
<li>4 . 给家里打电话</li>
<li>5 . 给女朋友家里准备礼物</li>
<li>6 . 拜年</li>
</ul>
</div>
</div>
<div id="outline-container-org479c448" class="outline-4">
<h4 id="org479c448"><span class="section-number-4">1.5.3</span> WantDo</h4>
<div class="outline-text-4" id="text-1-5-3">
<ul class="org-ul">
<li>1 . &#x2026;</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-01-10</p>
<p class="author">Author: rzry <a href="https://github.com/rzry">https://github.com/rzry</a></p>
<p class="date">Created: 2021-02-08 一 15:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
